linear.measurement.mongo.update.original.v.1.26/mongo.op_update.total_info.threads_480.txt
[UPDATE], 95thPercentileLatency(us), 159487
[UPDATE], AverageLatency(us), 91259.08571428571
[OVERALL], Throughput(ops/sec), 1718.213058419244
[UPDATE], 95thPercentileLatency(us), 181375
[UPDATE], AverageLatency(us), 93531.91764705883
[OVERALL], Throughput(ops/sec), 1569.8587127158555
[UPDATE], 95thPercentileLatency(us), 376319
[UPDATE], AverageLatency(us), 139400.6796875
[OVERALL], Throughput(ops/sec), 1020.4081632653061
[UPDATE], 95thPercentileLatency(us), 164607
[UPDATE], AverageLatency(us), 86645.41632653061
[OVERALL], Throughput(ops/sec), 1472.7540500736377
[UPDATE], 95thPercentileLatency(us), 174847
[UPDATE], AverageLatency(us), 62471.01556420233
[OVERALL], Throughput(ops/sec), 1494.7683109118086
[UPDATE], 95thPercentileLatency(us), 151551
[UPDATE], AverageLatency(us), 101332.65587044535
[OVERALL], Throughput(ops/sec), 1615.5088852988692
[UPDATE], 95thPercentileLatency(us), 211583
[UPDATE], AverageLatency(us), 91951.96378269617
[OVERALL], Throughput(ops/sec), 1479.2899408284025
[UPDATE], 95thPercentileLatency(us), 187775
[UPDATE], AverageLatency(us), 98693.87751004015
[OVERALL], Throughput(ops/sec), 1503.7593984962407
[UPDATE], 95thPercentileLatency(us), 135807
[UPDATE], AverageLatency(us), 76338.07961165048
[OVERALL], Throughput(ops/sec), 1655.6291390728477
[UPDATE], 95thPercentileLatency(us), 198271
[UPDATE], AverageLatency(us), 112630.8844621514
[OVERALL], Throughput(ops/sec), 1531.3935681470139
[UPDATE], 95thPercentileLatency(us), 152831
[UPDATE], AverageLatency(us), 98408.04391217565
[OVERALL], Throughput(ops/sec), 1506.0240963855422
[UPDATE], 95thPercentileLatency(us), 119679
[UPDATE], AverageLatency(us), 68726.16147859923
[OVERALL], Throughput(ops/sec), 1700.6802721088436
[UPDATE], 95thPercentileLatency(us), 132607
[UPDATE], AverageLatency(us), 84512.02605210421
[OVERALL], Throughput(ops/sec), 1620.7455429497568
[UPDATE], 95thPercentileLatency(us), 184319
[UPDATE], AverageLatency(us), 115199.1595959596
[OVERALL], Throughput(ops/sec), 1508.2956259426849
[UPDATE], 95thPercentileLatency(us), 203135
[UPDATE], AverageLatency(us), 110749.972
[OVERALL], Throughput(ops/sec), 1594.896331738437
[UPDATE], 95thPercentileLatency(us), 129855
[UPDATE], AverageLatency(us), 66392.73877551021
[OVERALL], Throughput(ops/sec), 1683.5016835016836
[UPDATE], 95thPercentileLatency(us), 191231
[UPDATE], AverageLatency(us), 93170.50707070707
[OVERALL], Throughput(ops/sec), 1633.986928104575
[UPDATE], 95thPercentileLatency(us), 150911
[UPDATE], AverageLatency(us), 71200.87102803738
[OVERALL], Throughput(ops/sec), 1650.1650165016501
[UPDATE], 95thPercentileLatency(us), 149247
[UPDATE], AverageLatency(us), 71113.71316306484
[OVERALL], Throughput(ops/sec), 1607.717041800643
[UPDATE], 95thPercentileLatency(us), 172031
[UPDATE], AverageLatency(us), 102788.51730769231
[OVERALL], Throughput(ops/sec), 1584.7860538827258